Autodesk.Revit.DB.DialogOptions.RenameDialogOptions.SetProhibitedNames(System.Collections.Generic.IList{System.String})
setProhibitedNames
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.DialogOptions.RenameDialogOptions.GetProhibitedNames
getProhibitedNames
Since:
2027

Autodesk.Revit.DB.DialogOptions.RenameDialogOptions.NewName
newName
Since:
2027

Autodesk.Revit.DB.DialogOptions.RenameDialogOptions.OldName
oldName
Since:
2027

Autodesk.Revit.DB.DialogOptions.RenameDialogOptions.#ctor(System.String,System.String,System.UInt32,System.String)
constructor
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.DialogOptions.RenameDialogOptions.#ctor
parameterless constructor
Since:
2027

Autodesk.Revit.DB.DialogOptions.RenameDialogOptions
The specific class for Rename dialog options as the input for ManagedCallEventArgs.
Since:
2027